# Eksik Veriler Oldugunda Ne Yapacagiz?

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
havadurumuData = {'İstanbul':[30,29,np.nan], 'Ankara':[20,np.nan,25], 'İzmir':[40,39,38]}

In [5]:
havadurumuDataFrame = pd.DataFrame(data=havadurumuData, index=['Pazartesi', 'Salı', 'Çarşamba'])

In [6]:
havadurumuDataFrame

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Çarşamba        NaN    25.0     38

### Veri Setimiz ustteki gibi olsun.

#### Eksik Verileri Silelim;

dropna() komutu yeni bir DataFrame dondurur!
Ve bu komut sadece ayni ROW'da NaN olmayan degerleri getirir. 1 ROW'da 1 tane NaN olursa direk o ROW'u siler!!! Bunun onune gecmek icin 'Axis' kullanmamiz lazim!

In [7]:
havadurumuDataFrame.dropna(axis=0) # NaN olan verileri sildik - axis=0 ROW

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40

In [8]:
havadurumuDataFrame.dropna(axis=1) # axis=1 Column

           İzmir
Pazartesi     40
Salı          39
Çarşamba      38

#### Goruldugu gibi dropna() fonksiyonu ayri bir Data Frame dondurur.

In [9]:
havadurumuDataFrame

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Çarşamba        NaN    25.0     38

## Verileri Sildigimizde Karsilasacagimiz Goruntu Bu Oluyor.

Ornegin 1000 tane data'nin bulundugu bir Data Set'te 3 5 10 veri silmek sonucu buyuk olcude etkilemez ancak 100 200 tane eksik veriyi silmek tavsiye edilen bir durum degildir.

### Yeni bir Data Frame ile farkli bir ornek yapalim;

In [36]:
yeniData = {'İstanbul':[30,29,np.nan], 'Ankara':[20,np.nan,25], 'İzmir':[40,39,38], 'Antalya':[45, np.nan, np.nan]}

In [38]:
yeniHavaDurumuDataFrame = pd.DataFrame(data=yeniData, index=['Pazartesi', 'Salı', 'Çarşamba'])

In [39]:
yeniHavaDurumuDataFrame

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40     45.0
Salı           29.0     NaN     39      NaN
Çarşamba        NaN    25.0     38      NaN

#### Column'larda 2 tane NaN olanlari drop edelim;

In [44]:
yeniHavaDurumuDataFrame.dropna(axis=1, thresh=2) # thresh=2   2 ve uzeri NaN olanlari drop et demek

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Çarşamba        NaN    25.0     38

#### Row'larda 2 ve daha fazla NaN iceren ifadeleri drop ettik

In [48]:
yeniHavaDurumuDataFrame.dropna(axis=0, thresh=3)

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40     45.0

# Eksik Verileri(NaN) Doldurmak Istersek;

In [49]:
yeniHavaDurumuDataFrame

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40     45.0
Salı           29.0     NaN     39      NaN
Çarşamba        NaN    25.0     38      NaN

### fillna(value) -> value = NaN olanlarin yerine gelmesini istedigimiz deger

In [54]:
yeniHavaDurumuDataFrame.fillna(33) # NaN olanlari 33 ile degistir

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40     45.0
Salı           29.0    33.0     39     33.0
Çarşamba       33.0    25.0     38     33.0

#### Goruldugu gibi fillna() fonksiyonuda yeni bir Data Frame donduruyor

In [55]:
yeniHavaDurumuDataFrame

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40     45.0
Salı           29.0     NaN     39      NaN
Çarşamba        NaN    25.0     38      NaN